Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_services/children_s_health/caring_for_a_child_with_a_disability.html.txt.tmx
Source language: en
Languages: ga

source: Caring for a child with a disability
ga: Ag tabhairt aire do leanbh atá faoi mhíchumas

source: If you have a child with a disability you need to know about the various services in place to support you
ga: Má tá leanbh agat atá faoi mhíchumas ba chóir duit a bheith ar an eolas faoi na seirbhísí áirithe atá ann chun tacú leat

source: Legally, a child is someone under the age of 18 years
ga: De réir an dlí in Éirinn, is leanbh é duine atá faoi 18 mbliana d’aois

source: Often however, parents (or other family members) continue to care for children with disabilities long after they reach adulthood
ga: Is minic, áfach, a leanann tuismitheoirí (nó baill eile teaghlaigh) d’aire a thabhairt do pháistí atá faoi mhíchumas i bhfad i ndiaidh dóibh aosacht a bhaint amach

source: Children with disabilities are entitled to the same services and family benefits as all other children
ga: Bíonn leanaí atá faoi mhíchumas i dteideal na seirbhísí céanna agus na sochar céanna teaghlaigh agus a bhíonn leanaí eile

source: The emphasis in the following information is on those services and payments specifically related to disability
ga: Tá an bhéim san eolas seo a leanas ar na seirbhísí agus na híocaíochtaí sin a bhfuil baint faoi leith acu le míchumas

source: They apply whether the child was born with the disability or acquired it later
ga: Téann siad i bhfeidhm má rugadh an leanbh faoi mhíchumas nó mar tháinig sé air níos moille

source: GPs (family doctors) provide free developmental examinations in the weeks following birth
ga: Soláthraíonn dochtúirí teaghlaigh scrúduithe forbartha saor in aisce sna seachtainí i ndiaidh breithe

source: Public health nurses monitor the development of babies in their first months and can provide information and support
ga: Déanann altraí sláinte phoiblí monatóireacht ar fhorbairt na leanaí sna céad míonna agus is féidir leo eolas agus tacaíocht a sholáthar

source: Children with a disability who were born after 1 June 2002 are entitled to an assessment of need of health supports and services and to get an Assessment Report and a statement of the services they will receive
ga: Tá leanaí faoi mhíchumas a rugadh tar éis an 1 Meitheamh 2002 i dteideal measúnú riachtanais de thacaíochtaí sláinte agus seirbhísí agus chun Tuarascáil Measúnuithe a fháil agus ráiteas ar na seirbhísí a bhfaighidh siad

source: Health services for children with disabilities are organised and delivered differently in different areas
ga: Tá seirbhísí sláinte do leanaí faoi mhíchumas eagraithe agus curtha ar fáil ar bhealaí éagsúla in áiteanna difriúla

source: Your Local Health Office can tell you the services that are available in your area
ga: Is féidir le d'Oifig Sláinte Áitiúil insint duit cé na seirbhísí atá ar fáil i do cheantar

source: Your child may be eligible for a medical card or GP visit card depending on your circumstances
ga: Seans go mbeadh do leanbh i dteideal ar chárta leighis nó cárta cuairte LG ag brath ar do choinníollacha

source: The GP visit card is available to all children under the age of 6, without an income test
ga: Tá do chárta cuairte LG ar fáil do gach leanbh faoi aois 6, gan aon tástáil ioncaim

source: People who have certain conditions that are covered by the Long Term Illness Scheme can get free medicines and appliances for those conditions
ga: Is féidir le daoine a bhfuil coinníollacha áirithe acu a bhfuil clúdaithe ag Scéim Tinneas Fadtéarmach cóir leighis agus fearais do na coinníollacha a fháil saor in aisce

source: There are charges for public hospitals but some people are exempt, including medical card holders, children up to six weeks of age, children who have certain diseases and disabilities, and children referred from child health clinics or school health checks
ga: Tá táillí ann d'ospidéil phoiblí ach tá díolúine ag roinnt daoine, coinnitheoirí cárta leighis, leanaí suas go sé seachtaine d'aois, leanaí a bhfuil galair nó míchumas áirithe acu, agus leanaí a seoltar ó chlinicí sláinte leanaí nó seiceálacha sláinte scoile

source: Community care services include public health nurses, social workers, occupational therapists, home help services, chiropody services, speech and language therapy services, respite care and day care
ga: Is éard atá i gceist le seirbhísí cúram pobail ná altraí sláinte poiblí, oibrithe sóisialta, teiripeoirí sláinte, cúntóirí baile, seirbhísí cosliachta, seirbhísí teiripe urlabhra agus teanga, cúram faoisimh agus cúram lae

source: The Health Information and Quality Authority (HIQA) is responsible for the regulation of residential services for children and adults with disabilities
ga: Tá an tÚdarás um Cháilíocht agus Eolas Sláinte freagrach as rialachán ar sheirbhísí cónaitheacha do leanaí agus d'aosaigh faoi mhííchumas

source: Children with a disability who were born after 1 June 2002 are entitled to an assessment of need of education supports and services
ga: Tá leanaí faoi mhíchumas a rugadh tar éis an 1 Meitheamh 2002 i dteideal ar mheasúnú riachtanais de thacaíochtaí agus seirbhísí oideachais

source: The Early Childhood Care and Education Scheme (ECCE) provides free early childhood care and education for children of pre-school age
ga: Soláthraíonn an Scéim Cúraim agus Oideachais Luath-Óige cúram luath-óige saor in aisce agus oideachas do leanaí ar aois réamhscoile iad

source: The Access and Inclusion Model (AIM) provides supports to help children with a disability access the ECCE
ga: Solááthraíonn an Múnla um Rochtain agus Chuimsiú tacaíochtaí chun cuidiú le leanaí faoi mhíchumas rochtain a fháil ar an Scéim Cúraim agus Oideachais Luath-Óige

source: Special needs education provides supports to help children with disabilities in primary education and post-primary education
ga: Soláthraíonn Oideachas Riachtanas Speisialta tacaíochtaí chun cuidiú le leanaí faoi mhíchumas sa bhunoideachas agus san oideachas iarbhunscoile

source: Many areas have school transport for children with special needs
ga: Tá iompar scoile do ghasúir le riachtanais speisialta i go leor ceantracha

source: There are also supports for third-level students with a disability
ga: Tá tacaíochtaí ann freisin do mhic-léinn tríú leibhéil faoi mhíchumas

source: Providing for a child with a disability
ga: Ag soláthar do leanbh faoi mhíchumas

source: Although a child with a disability may be maintained by their parents after the age of 18 this does not provide them with any special entitlement to provision in a parent’s will
ga: Cé gur féidir le tuismitheoirí leanbh faoi mhíchumas a chothabháil i ndiaidh dóibh a bheith 18 bliana d'aois, ní sholáthraíonn seo iad le haon teidlíocht speisialta d'aon soláthar in uacht tuismitheora

source: If you want to make specific provision for your child, you should get legal advice
ga: Más mian leat aon soláthar speisialta a dhéanamh do do leanbh, ba cheart duit comhairle dleathach a lorg

source: One option is a trust from which your child may benefit after your death
ga: Rogha amháin is ea iontaobhas as ar féidir le do leanbh leasa a bhaint as i ndiaidh duit bás a fháil

source: Many parents use discretionary trusts to provide for a child with a disability without affecting entitlement to benefits
ga: Úsáideann go leor tuismitheoirí iontaobhais lánroghnacha chun soláthar do leanbh faoi mhíchumas gan cur isteach ar theidlíochtaí agus sochair

source: You may use a covenant as a tax-efficient way to give money to a child aged over 18, but this could affect the child’s entitlement to Disability Allowance
ga: Is féidir cúnant a úsáid mar bhealach cáinéifeachtúil chun airgead a thabhairt do leanbh ar aois 18 é/í nó níos mó, ach seans go bhféadfadh seo cur isteach ar theidlíocht linbh ar an Liúntas Míchumais

source: Most public sector occupational pension schemes, and some private sector schemes, have provisions that allow for the pension arrangements for dependent children to continue for the lifetime of a permanently incapacitated child
ga: Tá soláthair ag an gcuid is mó de scéimeanna pinsin gairme, agus ag roinnt scéimeanna de chuid na hearnála poiblí a cheadaíonn do shocrúcháin pinsin leanacht ar aghaidh do ghasúir cleithiúnacha do shaol iomlán leanbh ar éagumas

source: You may qualify for supports for carers
ga: Is féidir cáiliú do thacaíocht do chúramóirí

source: There is a range of social welfare payments for people who have a disability
ga: Tá réimse íocaíochtaí leasa shóisialaigh do dhaoine faoi mhíchumas

source: These include Disability Allowance which your child may be entitled to when they reach the age of 16
ga: Ina measc tá Liúntas Míchumais a bhfuil seans ann go bhfuil do ghasúr i dteideal air nuair a shroicheann sé/sí 16 bliain d'aois

source: If your child takes up employment, it may affect their Disability Allowance
ga: Má thugann do leanbh faoi fhostaíocht, seans go mbeidh éifeacht aige ar a Liúntas Míchumais

source: For more information about this, see Disability payments and work
ga: Chun tuilleadh eolais a fháil, féach Íocaíochtaí míchumais agus obair

source: People with disabilities may access rehabilitative training for core life skills or vocational training for work-related skills
ga: Is féidir le daoine faoi mhíchumas rochtain a fháil ar thraenáil athshlánúcháin do scoileanna saoil lárnacha nó traenáil ghairme do scileanna a bhaineann le hobair

source: Read more about rehabilitation and training services for people with disabilities
ga: Léigh a thuilleadh faoi sheirbhísí athshlánúcháin agus traenála do dhaoine faoi mhíchumas

source: Employment supports aim to help people with a disability gain and retain employment
ga: Tá sé de chuspóir ag tacaíochtaí fostaíochta cúnamh a thabhairt do dhaoine faoi mhíchumas chun fostaíocht a fháil agus a choinneáil

source: Under the Disabled Drivers and Disabled Passengers Scheme, tax reliefs are available for the costs of buying and using a vehicle
ga: Faoin scéim Tiománaithe faoi mhíchumas agus Paisinéirí faoi mhíchumas, tá faoiseamh cánach ar fáil do chostais feithicil a cheannach agus a úsáid

source: If you need to adapt your house for your child's needs you may qualify for the Housing Adaptation Grant
ga: Más gá do theach a oiriúnú do riachtanais do linbh, seans go bhfuil tú incháilithe don Deontas Oiriúnaithe Tithe

source: If your child is getting Disability Allowance, but is not capable of managing money, you may be the agent appointed by the Department of Social Protection to deal with the money
ga: Má tá do leanbh ag fáil Liúntas Míchumais, ach nach bhfuil ábalta airgead a bhainistiú, seans go mbeidh i do ghníomhaire ceaptha ag an Roinn Coimirce Sósialaí chun déileáil leis an airgead

source: The money belongs to your child and you must use it for their benefit
ga: Is le do leanbh an t-airgead agus ba cheart é a úsáid ar mhaith leo siúd

source: If your child has substantial money or assets, they may be made a Ward of Court
ga: Má tá a dhóthain airgid nó acmhainní ag do pháiste, is féidir Coimirciú Cúirte a dhéanamh dóibh

source: Planning for the future
ga: Ag pleanáil le haghaidh an todhchaí

source: Most parents of people with disabilities want to try to ensure that their children will be adequately cared for after their own deaths
ga: Is mian leis an gcuid is mó de thuismitheoirí daoine atá faoi mhíchumas cinnte a dhéanamh de go dtabharfar aire chuí dá gcuid leanaí i ndiaidh dóibh féin bás a fháil

source: You should get legal advice if you want to make special provisions for a child with a disability in your will and also ensure that they retain entitlement to benefits such as the Disability Allowance and medical card
ga: Ba chóir duit comhairle dlí a fháil dá mba mhaith leat forálacha speisialta a dhéanamh i do thiomna le haghaidh linbh atá faoi mhíchumas agus cinnte a dhéanamh de go mbíonn siad i dteideal sochar ar nós Liúntas Míchumais agus cárta leighis go fóill

source: You may appoint a guardian in your will
ga: Tá cead agat caomhnóir a ainmniú i do thiomna

source: This however only applies if your child is under 18 when it comes into effect
ga: Ní théann sé seo i bhfeidhm, áfach, ach amháin má bhíonn do leanbh faoi 18 mbliana d’aois nuair a fhaigheann tú bás

source: It is not possible to appoint a guardian for an adult child
ga: Níl féidir caomhnóir a ainmniú le haghaidh leanbh fásta
